artillery/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 30
      name: "Ramp up load"
    - duration: 30
      arrivalRate: 50
      name: "Peak load"

scenarios:
  - name: "CRUD loan operations"
    flow:
      - get:
          url: "/api/loans"
      - post:
          url: "/api/loans"
          json:
            applicant_name: "Test User"
            loan_amount: 10000
            interest_rate: 5.5
      - get:
          url: "/api/loans/1"